/*========================================================================================
模块名    ：dbix.lib
文件名    ：sql_layer.h
相关文件  ：
实现功能  ：封装不同数据库间的SQL语法差异。
作者      ：huzhiyun
版权      ：<Copyright(C) 2003-2008 Suzhou Keda Technology Co., Ltd. All rights reserved.>
-------------------------------------------------------------------------------------------
修改记录：
日期               版本              修改人             走读人              修改记录
2012/05/09         V1.0              huzhiyun                              新建文件
=========================================================================================*/
#ifndef _SQL_LAYER_H_
#define _SQL_LAYER_H_
#include "inner_common.h"

DBIX_NS_BEGIN

// 公共接口中的头文件申明不重复定义

DBIX_NS_END
#endif // _SQL_LAYER_H_
